In [1]:
import pandas as pd

In [5]:
series = pd.Series([4,8,15,16,23,42])

In [6]:
series

0     4
1     8
2    15
3    16
4    23
5    42
dtype: int64

In [8]:
list = ['a','b','c','d','e','f','g','h','i','j']

In [12]:
l =  pd.Series(list)

In [13]:
l

0    a
1    b
2    c
3    d
4    e
5    f
6    g
7    h
8    i
9    j
dtype: object

In [31]:
 df  = pd.DataFrame({'Name':['Alice','Bob','Claire'],
                    'Age':[25,30,27],
                     'Gender':['Female','Male','Female']
                    
                    })

In [15]:
df

     Name  Age  Gender
0   Alice   25  Female
1     Bob   30    Male
2  Claire   27  Female

In [16]:
''#Q4 'Pandas DataFrame is two-dimensional size-mutable, potentially heterogeneous tabular data structure with labeled axes (rows and columns). A Data frame is a two-dimensional data structure, i.e., data is aligned in a tabular fashion in rows and columns. Pandas DataFrame consists of three principal components, the data, rows, and columns.'''

'''Well they are different obviously, I think you are referring to certain operations that still return a dataframe either because you only have a single column dataframe or because the operation results in a single column dataframe. However when selecting a single column there is no ambiguity and this decomposes to a Series. You have to show sample code to explain what your issue i'''

'Well they are different obviously, I think you are referring to certain operations that still return a dataframe either because you only have a single column dataframe or because the operation results in a single column dataframe. However when selecting a single column there is no ambiguity and this decomposes to a Series. You have to show sample code to explain what your issue i'

In [17]:
data = [1000,2000,3000,4000,5000]
s=pd.Series(data)
s

0    1000
1    2000
2    3000
3    4000
4    5000
dtype: int64

In [34]:
data = [1000,2000,3000,4000,5000]
df1= pd.DataFrame(data,columns=['Columns'])
print(df1)

   Columns
0     1000
1     2000
2     3000
3     4000
4     5000

In [23]:
'''#Q5 dataframe ,readfrom and write to excel or csv in pandas,
get the mean,median,mode'''

'#Q4 dataframe ,readfrom and write to excel or csv in pandas,\nget the mean,median,mode'

In [24]:
#example

In [25]:
df

   Columns
0     1000
1     2000
2     3000
3     4000
4     5000

In [38]:
df['Age'].mean()

27.333333333333332

In [39]:
df['Age'].mode()

0    25
1    27
2    30
Name: Age, dtype: int64

In [40]:
#Q6''' a Panel can be illustrated as a container of a DataFrame. In Panel Data and size are mutable'''

In [42]:
course = pd.Series(['webdev','datascience','datastructure'])
fees = pd.Series([10000,20000,15000])
discount= pd.Series([100,200,150])

df = pd.concat([course,fees,discount],axis = 1)
df

               0      1    2
0         webdev  10000  100
1    datascience  20000  200
2  datastructure  15000  150